sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
enum led_states {
	LED_ADVERTISING,
	LED_CONNECTING,
	LED_CONNECTED,
	LED_DISCONNECTED,
	LED_GAP_TIMEOUT,
	LED_RUNNING,
	LED_SWITCHING_OFF,
	LED_ERROR
};
enum pwm_states {
	PWM_OFF,
	PWM_ON
};
enum pwm_pos {
	PWM_CONN = 0,
	PWM_DATA
};
struct batgauge_status_s {
	bool start;
	bool init_ok;
	bool enabled;
	bool new_value;
	uint32_t bat_level;
};
// Application state
typedef struct {
	enum sms_running_states running;
	enum led_states led[2];
	enum pwm_states pwm[2];
	struct batgauge_status_s batgauge;
}app_state_t;
app_state_t m_app_state;

// LED/buttons
static uint8_t 							m_button_mask = 0;							/* Button mask to remember previous pressing state */
// Batgauge/SAADC
static nrf_saadc_value_t     			m_buffer_pool[2][ADC_SAMPLES_IN_BUFFER];	/* Buffers to store n ADC samples (averaging) */
static uint32_t							m_adc_evt_counter;							/* ADC event counter (debug) */
// BLE/connection
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;	/* Handle of the current connection */
ble_smss_t								m_smss_service;								/* Structure used to identify the SMS service */
static ble_bas_t 						m_bas;                                   	/* Structure used to identify the battery service */
// PWM
static low_power_pwm_t					low_power_pwm_conn;							/* PWM instance for LED_0 (connection) */
static low_power_pwm_t					low_power_pwm_data;							/* PWM instance for LED_1 (data) */


// Timers
APP_TIMER_DEF(pressure_poll_int_id);
APP_TIMER_DEF(imu_poll_int_id);
APP_TIMER_DEF(button_press_timer_id);
APP_TIMER_DEF(saadc_timer_id);
APP_TIMER_DEF(led0_timer_id);
APP_TIMER_DEF(led1_timer_id);

// SPI
#define SPI_INSTANCE 0
const nrf_drv_spi_t spi_master_instance = NRF_DRV_SPI_INSTANCE(SPI_INSTANCE);
volatile bool spi_xfer_done;
#define SPI_MAX_LENGTH 100
uint8_t m_tx_buf[SPI_MAX_LENGTH] = {0};
uint8_t m_rx_buf[SPI_MAX_LENGTH + 1];

// TWI
#define TWI_INSTANCE 1
const nrf_drv_twi_t twi_master_instance = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE);
volatile bool twi_xfer_done;

// Pressure
extern ms58_output_s ms58_output;
extern ms58_config_s ms58_config;
extern ms58_interrupt_s ms58_interrupt;

// IMU
extern bno055_output_s bno055_output;
extern bno055_config_s bno055_config;
extern bno055_interrupt_s bno055_interrupt;

/* ====================================================================
 * FUNCTIONS DECLARATIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
void advertising_start(void);
void sensors_stop(void);


/**@brief Application error handler overwitten.
 *
 * @param[in] id
 * @param[in] pc
 * @param[in] info
 */
void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info)
{
NRF_LOG_DEBUG("ERROR! ID: %d, PC: %d, INFO: %d\n\r", id, pc, info);
#ifndef DEBUG
	NVIC_SystemReset();
#else
	while(1){};
#endif //DEBUG
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Blink both LEDs in alternance to signal switch-off procedure.
 *
 * @details For simplification reasons, this function uses a blocking delay. Since everything has
 *			already been disabled before (BLE, PWM, timers) this is not an issue.
 */
static void leds_blink_off(void)
{
	bsp_board_leds_off();
	for(int i = 0; i < 4; i++) {
		bsp_board_led_on(SMS_CONN_LED_PIN);
		nrf_delay_ms(100);
		bsp_board_led_off(SMS_CONN_LED_PIN);
		bsp_board_led_on(SMS_DATA_LED_PIN);
		nrf_delay_ms(100);
		bsp_board_led_off(SMS_DATA_LED_PIN);
	}
	bsp_board_leds_off();
}


/**@brief Switch off SMS device.
 *
 * @details	Stop BLE advertising or disconnect, and disable running tasks (PWM, timers).
 *			Only the buttons remain active (for restarting).
 *
* @param[in] restart	If restart is set, reinitialise everything and start advertising (TBD!).
 */
static void sms_switch_off(bool restart)
{
	uint32_t err_code;
	
	NRF_LOG_DEBUG("Switching-off SMS sensors...\n\r");
	
	bno055_interrupt.new_value = false;
	bno055_interrupt.rts = false;
	bno055_interrupt.enabled = false;
	
	ms58_interrupt.new_value = false;
	ms58_interrupt.rts = false;
	ms58_interrupt.enabled = false;
	
	m_app_state.batgauge.new_value = false;
	m_app_state.batgauge.enabled = false;
	
	if(m_app_state.running == SMS_ADVERTISING) {
		NRF_LOG_DEBUG("Adv stop err_code: 0x%04x\n\r", err_code);
		err_code = sd_ble_gap_adv_stop();
		APP_ERROR_CHECK(err_code);
		m_app_state.running = SMS_OFF;
	}
	if(m_app_state.running == SMS_RUNNING) {
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
		NRF_LOG_INFO("Disconnect err_code: 0x%04x\n\r", err_code);
		if(!restart) {
			m_app_state.running = SMS_OFF;
		}
	}
	low_power_pwm_stop(&low_power_pwm_conn);
	low_power_pwm_stop(&low_power_pwm_data);
	app_timer_stop_all();
	
	leds_blink_off();	
	
	m_conn_handle = BLE_CONN_HANDLE_INVALID;
}

/**@brief Switch on SMS device.
 *
 * @details	Start advertising for 120 seconds.
 */
static void sms_switch_on(void)
{
	NRF_LOG_DEBUG("Switching-on SMS sensors...\n\r");
	advertising_start();
}


/* ====================================================================
 * HANDLERS
 * --------------------------------------------------------------------
 * Has to be defined first to be called by the init functions
 * ==================================================================== */
/**@brief Pressure polling handler.
 *
 * @details	Set the new value flag.
 *
 * @param[in] p_context	unused
 */
static void pressure_poll_int_handler(void * p_context)
{
	ms58_interrupt.new_value = true;
}

