sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
/**@brief IMU polling handler.
 *
 * @details	Set the new value flag.
 *
 * @param[in] p_context	unused
 */
static void imu_poll_int_handler(void * p_context)
{
	bno055_interrupt.new_value = true;
}

/**@brief Button pressed timeout handler.
 *
 * @details	1. check if and which button is pressed
 *			2. compare the current state with the button mask
 *			3. handle according to the comparison
 *
 * @param[in] p_context	unused
 */
static void button_press_timeout_handler(void * p_context)
{
	uint8_t button_state = 0;
	UNUSED_PARAMETER(p_context);
	
	if(app_button_is_pushed(0)) button_state |= 0x01;
	if(app_button_is_pushed(1)) button_state |= 0x10;
	NRF_LOG_DEBUG("Button long press timeout!! Button state = 0x%02x\n\r", button_state);

	if(button_state == m_button_mask) {
		if(button_state == 0x11) {
			NRF_LOG_DEBUG("DOUBLE long press!! SMS state: %d\n\r", m_app_state.running);
			if((m_app_state.running == SMS_ADVERTISING) || (m_app_state.running == SMS_RUNNING)) {
				sms_switch_off(false);
			}
		}
		else if((button_state == 0x01) || (button_state == 0x10)) {
			NRF_LOG_DEBUG("SINGLE long press!! SMS state: %d\n\r", m_app_state.running);
			if(m_app_state.running == SMS_OFF) {
				sms_switch_on();
			}
		}
	}
	// Reset button mask to force complete button release before next detection
	m_button_mask = 0;
}




// Hardware interrupts
/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    uint32_t err_code;
	static uint16_t send_value = 0;

    switch (pin_no)
    {
        case SMS_BUTTON1_PIN:
			if(button_action) send_value |= 0xFF;
			else send_value &= 0xFF00;
			NRF_LOG_DEBUG("Bt1 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if (err_code != NRF_SUCCESS &&						// 0x0000
				err_code != BLE_ERROR_INVALID_CONN_HANDLE &&	// 0x3002
				err_code != NRF_ERROR_INVALID_STATE &&			// 0x0008
				err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)	// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}
			
			if(button_action) m_button_mask |= 0x01;
			else m_button_mask &= 0xF0;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", m_button_mask);
			app_timer_stop(button_press_timer_id);
			if(m_button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}
			
            break;

		case SMS_BUTTON2_PIN:
			if(button_action) send_value |= 0xFF00;
			else send_value &= 0x00FF;
			NRF_LOG_DEBUG("Bt2 pressed\r\n", send_value);
			err_code = ble_smss_on_button_change(&m_smss_service, send_value);
			if (err_code != NRF_SUCCESS &&						// 0x0000
				err_code != BLE_ERROR_INVALID_CONN_HANDLE &&	// 0x3002
				err_code != NRF_ERROR_INVALID_STATE &&			// 0x0008
				err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)	// 0x3401
			{
				APP_ERROR_CHECK(err_code);
			}

			if(button_action) m_button_mask |= 0x10;
			else m_button_mask &= 0x0F;
			
			NRF_LOG_DEBUG("Stopping button timer... mask = 0x%02x\n\r", m_button_mask);
			app_timer_stop(button_press_timer_id);
			if(m_button_mask != 0) {
				NRF_LOG_DEBUG("Re-starting button timer...\n\r");
				app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);		
			}

			break;
		
        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}



/**@brief Function for handling an SPI event.
 *
 * @details	Set the xfer done flag.
 *
 * @param[in] p_event	unused
 */
void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
	UNUSED_PARAMETER(p_event);
    spi_xfer_done = true;
}
/**@brief Function for handling a TWI event.
 *
 * @details	Set the xfer done flag.
 *
 * @param[in] p_event	Select which TWI event has called the handler
 * @param[in] p_context	Unused
 */
void twi_event_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
	UNUSED_PARAMETER(p_context);
	
	twi_xfer_done = true;
	switch(p_event->type)
	{
		case NRF_DRV_TWI_EVT_DONE:
			twi_xfer_done = true;
			break;
		default:
			break;
	}	
}
/**@brief Function for handling a batgauge event.
 *
 * @details	After ADC_SAMPLES_IN_BUFFER ADC sampling, the batgauge handler is called to calculate a
 *			battery level value and set the new value flag.
 *
 * @param[in] p_event	Select which SAADC event has called the handler
 */
void batgauge_event_handler(nrf_drv_saadc_evt_t const * p_event)
{
	NRF_LOG_DEBUG("Batgauge event!!\n\r");
	if(p_event->type == NRF_DRV_SAADC_EVT_DONE)
	{
		ret_code_t err_code;
		err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, ADC_SAMPLES_IN_BUFFER);
		APP_ERROR_CHECK(err_code);
		
		uint8_t i;
		uint32_t sum = 0;
		NRF_LOG_DEBUG("ADC event number: %d\n\r", (int)m_adc_evt_counter);
		for(i = 0; i < ADC_SAMPLES_IN_BUFFER; i++)
		{
			m_buffer_pool[0][i] = p_event->data.done.p_buffer[i];
			NRF_LOG_DEBUG("%d\r\n", m_buffer_pool[0][i]);
			sum += m_buffer_pool[0][i];
		}
		m_app_state.batgauge.bat_level = sum / ADC_SAMPLES_IN_BUFFER;
		NRF_LOG_DEBUG("Batgauge avg: %d (sum: %d)\n\r", m_app_state.batgauge.bat_level, sum);
		m_adc_evt_counter++;
		m_app_state.batgauge.new_value = true;
	}
}

/**@brief Function for handling the saadc timer.
 *
 * @details	Start a new SAADC sampling sequence.
 *
 * @param[in] p_context	unused
 */
static void saadc_timer_handler(void * p_context)
{
	NRF_LOG_DEBUG("saadc timer done\n\r");
	nrf_drv_saadc_sample();
}

/**@brief Function for handling a PWM event.
 *
 * @details	Depending on the PWM instance and the current LED state, toggle the
 *			PWM or switch it off.
 *
 * @param[in] p_context	Select the PWM instance which has called the handler.
 */
static void pwm_handler(void * p_context)
{
	static uint16_t led_0, led_1;
	static uint8_t blink_cnt, tc;
	uint32_t toggle_max;
	uint32_t err_code;
	uint8_t tc_max = 100/SMS_LED_RUNNING_DUTY;
	UNUSED_PARAMETER(p_context);

