sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
	low_power_pwm_t * pwm_instance = (low_power_pwm_t*)p_context;
	
	// Commands for LED_0
	if(pwm_instance->bit_mask == BSP_LED_0_MASK)
	{
		led_0++;
		
		switch(m_app_state.led[0]) {
			case LED_ADVERTISING:
				toggle_max = SMS_LED_BLINK_MEDIUM_TICKS;
				break;
			case LED_CONNECTING:
				toggle_max = SMS_LED_BLINK_ULTRA_TICKS;
				break;
			default:
				toggle_max = 0;
				break;
		}
				
		if(led_0 > toggle_max) {
			if(m_app_state.led[0] == LED_ADVERTISING) {
				if(pwm_instance->duty_cycle > 0) {
					err_code = low_power_pwm_duty_set(pwm_instance, 0);
				}
				else {
					err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
				}
				APP_ERROR_CHECK(err_code);
			}
			else if(m_app_state.led[0] == LED_CONNECTING) {
				if(pwm_instance->duty_cycle > 0) {
					blink_cnt++;
					err_code = low_power_pwm_duty_set(pwm_instance, 0);
				}
				else {
					err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
				}
				APP_ERROR_CHECK(err_code);
				if(blink_cnt > 4) {
					blink_cnt = 0;
					m_app_state.pwm[0] = PWM_OFF;
					m_app_state.led[0] = LED_CONNECTED;
					m_app_state.running = SMS_RUNNING;
					ms58_config.dev_start = true;
					bno055_config.dev_start = true;
					m_app_state.batgauge.start = true;
				}
			}
			led_0 = 0;
		}
	}
	// Commands for LED_1
	else if(pwm_instance->bit_mask == BSP_LED_1_MASK)
	{
		led_1++;
		
		switch(m_app_state.led[1]) {
			case LED_RUNNING:
				toggle_max = SMS_LED_BLINK_FAST_TICKS;
				break;
			default:
				toggle_max = 0;
				break;
		}
		
		if(led_1 > toggle_max) {
			if(m_app_state.led[1] == LED_RUNNING) {
				if(pwm_instance->duty_cycle > 0) {
					tc = 0;
					err_code = low_power_pwm_duty_set(pwm_instance, 0);
				}
				else {
					tc++;
					if(tc > tc_max) {
						err_code = low_power_pwm_duty_set(pwm_instance, SMS_LED_ON_DUTY);
					}
					else {
						err_code = low_power_pwm_duty_set(pwm_instance, 0);
					}
				}
				APP_ERROR_CHECK(err_code);
			}
			else if(m_app_state.led[1] == LED_DISCONNECTED) {
				m_app_state.pwm[1] = PWM_OFF;
			}
			led_1 = 0;
		}
	}
}

// BLE
/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;
	
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
//            sleep_mode_enter();
            break;
        default:
            break;
    }
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling the Application's BLE stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
			NRF_LOG_INFO("Connected\r\n");
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
			m_app_state.led[0] = LED_CONNECTING;
			m_app_state.pwm[1] = PWM_ON;
			m_app_state.led[1] = LED_RUNNING;
			low_power_pwm_start(&low_power_pwm_data, low_power_pwm_data.bit_mask);
//			m_device_state = SMS_RUNNING;
					
            break; // BLE_GAP_EVT_CONNECTED

        case BLE_GAP_EVT_DISCONNECTED:
			NRF_LOG_INFO("Disconnected\r\n");
			m_app_state.led[1] = LED_DISCONNECTED;
			sensors_stop();
			if(m_app_state.running == SMS_RUNNING) {
				advertising_start();
			}

            break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                                   NULL,
                                                   NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GAP_EVT_SEC_PARAMS_REQUEST
		
		case BLE_GAP_EVT_TIMEOUT:
			NRF_LOG_DEBUG("GAP Event Timeout.\r\n");
			m_app_state.led[0] = LED_GAP_TIMEOUT;
			sms_switch_off(false);
			break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_SYS_ATTR_MISSING

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
			NRF_LOG_DEBUG("GATT Client Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTC_EVT_TIMEOUT

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
			NRF_LOG_DEBUG("GATT Server Timeout.\r\n");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_TIMEOUT

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = SMS_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

#if (NRF_SD_BLE_API_VERSION == 3)
        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:
            err_code = sd_ble_gatts_exchange_mtu_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                       NRF_BLE_MAX_MTU_SIZE);
            APP_ERROR_CHECK(err_code);
            break; // BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST
#endif

        default:
            // No implementation needed.
            break;
    }
}
/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack
 *          event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    on_ble_evt(p_ble_evt);
    ble_smss_on_ble_evt(&m_smss_service, p_ble_evt);
	ble_bas_on_ble_evt(&m_bas, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
}
/* ====================================================================
 * INITIALIZATIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
// Board
/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
//    bsp_board_leds_init();
	uint32_t err_code;
	low_power_pwm_config_t low_power_pwm_config;
	low_power_pwm_config.active_high = false;
	low_power_pwm_config.period = SMS_PWM_PERIOD;
	low_power_pwm_config.bit_mask = BSP_LED_0_MASK;
	low_power_pwm_config.p_timer_id = &led0_timer_id;
	low_power_pwm_config.p_port = NRF_GPIO;
	
	m_app_state.pwm[0] = PWM_OFF;
	err_code = low_power_pwm_init((&low_power_pwm_conn), &low_power_pwm_config, pwm_handler);
	APP_ERROR_CHECK(err_code);
	err_code = low_power_pwm_duty_set(&low_power_pwm_conn, SMS_LED_ON_DUTY);
	APP_ERROR_CHECK(err_code);
	
