sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
		// Start flag of the pressure (MS58) sensor
		if(ms58_config.dev_start)
		{
			nrf_gpio_pin_write(SMS_PRESSURE_SUPPLY_PIN, SMS_PRESSURE_SW_ON);
			pressure_enable();
			app_timer_start(pressure_poll_int_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_PRESSURE_POLL_MS, UNIT_1_00_MS), 0),
							NULL);
			ms58_interrupt.enabled = ms58_config.dev_en;
			ms58_config.dev_start = false;
		}
		
		// Start flag of the IMU (BNO055) sensor
		if(bno055_config.dev_start)
		{
			nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_ON);
			imu_enable();
			app_timer_start(imu_poll_int_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_IMU_POLL_MS, UNIT_1_00_MS), 0),
							NULL);
			bno055_interrupt.enabled = bno055_config.dev_en;
			bno055_config.dev_start = false;
		}
		
		// Start flag of the battery gauge (SAADC)
		if(m_app_state.batgauge.start)
		{
			nrf_drv_saadc_sample();
			app_timer_start(saadc_timer_id,
							APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BATGAUGE_SAMPLE_RATE_MS, UNIT_1_00_MS), 0),
							NULL);
			m_app_state.batgauge.enabled = true;
			m_app_state.batgauge.start = false;
		}

		// New value flag of the pressure sensor
		if((ms58_interrupt.enabled) && (ms58_interrupt.new_value))
		{
			nrf_gpio_pin_write(DBG1_PIN, 1);
			ms58_interrupt.new_value = false;
			pressure_poll_data();
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		
		// New value flag of the IMU
		if((bno055_interrupt.enabled) && (bno055_interrupt.new_value))
		{
			nrf_gpio_pin_write(DBG2_PIN, 1);
			bno055_interrupt.new_value = false;
			imu_poll_data(SMS_IMU_DATAMSK_QUAT);
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
		
		// New value flag of the battery gauge... sends notification automatically
		if(m_app_state.batgauge.new_value)
		{
			m_app_state.batgauge.new_value = false;
			uint32_t err_code;
			err_code = ble_bas_battery_level_update(&m_bas, (uint8_t)m_app_state.batgauge.bat_level);
			if ((err_code != NRF_SUCCESS) &&
				(err_code != NRF_ERROR_INVALID_STATE) &&
				(err_code != BLE_ERROR_NO_TX_PACKETS) &&
				(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
			   )
			{
				APP_ERROR_HANDLER(err_code);
			}
		}
		
		// RTS (ready-to-send) for ms58
		if((ms58_interrupt.enabled) && (ms58_interrupt.rts))
		{
			nrf_gpio_pin_write(DBG1_PIN, 1);
			ms58_interrupt.rts = false;
			int32_t * tosend;
			tosend = &ms58_output.pressure;
		    bsp_board_led_on(SMS_DATA_LED_PIN);
			err_code = ble_smss_on_press_value(&m_smss_service, tosend);
			bsp_board_led_off(SMS_DATA_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		
		// RTS (ready-to-send) for BNO055
		if((bno055_interrupt.enabled) && (bno055_interrupt.rts))
		{
			nrf_gpio_pin_write(DBG2_PIN, 1);
			bno055_interrupt.rts = false;
			uint32_t * tosend;
			tosend = (uint32_t*)&bno055_output.quat[0].b;
		    bsp_board_led_on(SMS_DATA_LED_PIN);
			err_code = ble_smss_on_imu_value(&m_smss_service, tosend);
		    bsp_board_led_off(SMS_DATA_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
	}
}


/**
 * @}
 */
